; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=140, out_folder=./training, instance_id=2, seed=2026, goal_proportion=0.03

(define (problem blocksworld-02)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 - object)
 (:init 
    (arm-empty)
    (clear b124)
    (on b124 b99)
    (on b99 b122)
    (on-table b122)
    (clear b32)
    (on b32 b23)
    (on b23 b11)
    (on b11 b101)
    (on b101 b53)
    (on-table b53)
    (clear b22)
    (on-table b22)
    (clear b24)
    (on-table b24)
    (clear b110)
    (on b110 b56)
    (on-table b56)
    (clear b6)
    (on b6 b5)
    (on b5 b73)
    (on-table b73)
    (clear b123)
    (on-table b123)
    (clear b79)
    (on b79 b94)
    (on b94 b116)
    (on b116 b100)
    (on-table b100)
    (clear b25)
    (on b25 b9)
    (on b9 b109)
    (on b109 b86)
    (on b86 b16)
    (on b16 b90)
    (on b90 b39)
    (on b39 b98)
    (on-table b98)
    (clear b85)
    (on b85 b84)
    (on b84 b138)
    (on b138 b102)
    (on b102 b3)
    (on b3 b130)
    (on b130 b18)
    (on b18 b97)
    (on b97 b125)
    (on b125 b28)
    (on-table b28)
    (clear b50)
    (on-table b50)
    (clear b76)
    (on b76 b114)
    (on-table b114)
    (clear b42)
    (on-table b42)
    (clear b89)
    (on b89 b20)
    (on b20 b43)
    (on-table b43)
    (clear b26)
    (on-table b26)
    (clear b36)
    (on b36 b70)
    (on b70 b35)
    (on b35 b112)
    (on b112 b61)
    (on b61 b111)
    (on-table b111)
    (clear b30)
    (on b30 b137)
    (on b137 b117)
    (on b117 b8)
    (on b8 b120)
    (on b120 b107)
    (on b107 b81)
    (on b81 b57)
    (on b57 b78)
    (on b78 b106)
    (on-table b106)
    (clear b140)
    (on b140 b80)
    (on-table b80)
    (clear b14)
    (on b14 b7)
    (on b7 b17)
    (on-table b17)
    (clear b128)
    (on-table b128)
    (clear b95)
    (on b95 b67)
    (on b67 b134)
    (on b134 b131)
    (on-table b131)
    (clear b54)
    (on b54 b34)
    (on b34 b68)
    (on b68 b121)
    (on b121 b119)
    (on b119 b77)
    (on b77 b65)
    (on b65 b118)
    (on b118 b15)
    (on b15 b64)
    (on-table b64)
    (clear b71)
    (on b71 b75)
    (on b75 b52)
    (on b52 b103)
    (on b103 b55)
    (on b55 b60)
    (on b60 b47)
    (on b47 b48)
    (on b48 b4)
    (on b4 b40)
    (on b40 b74)
    (on b74 b92)
    (on b92 b91)
    (on b91 b83)
    (on b83 b19)
    (on b19 b59)
    (on-table b59)
    (clear b127)
    (on b127 b38)
    (on-table b38)
    (clear b69)
    (on b69 b72)
    (on b72 b12)
    (on-table b12)
    (clear b44)
    (on-table b44)
    (clear b93)
    (on b93 b10)
    (on b10 b139)
    (on b139 b66)
    (on b66 b96)
    (on-table b96)
    (clear b49)
    (on b49 b104)
    (on b104 b46)
    (on b46 b45)
    (on b45 b33)
    (on-table b33)
    (clear b51)
    (on b51 b136)
    (on b136 b41)
    (on b41 b87)
    (on b87 b63)
    (on b63 b88)
    (on-table b88)
    (clear b115)
    (on b115 b133)
    (on-table b133)
    (clear b2)
    (on b2 b135)
    (on b135 b13)
    (on-table b13)
    (clear b105)
    (on-table b105)
    (clear b37)
    (on b37 b29)
    (on b29 b21)
    (on-table b21)
    (clear b1)
    (on b1 b62)
    (on b62 b113)
    (on-table b113)
    (clear b126)
    (on b126 b108)
    (on b108 b58)
    (on b58 b27)
    (on b27 b132)
    (on b132 b129)
    (on-table b129)
    (clear b82)
    (on-table b82)
    (clear b31)
    (on-table b31))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b3)
    (on-table b3)
    (clear b2)
    (on-table b2)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b1 b62)
   deleted: (on b1 b62) (clear b1) (arm-empty)
   added: (holding b1) (clear b62)
   goals met: 1 of 8
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 8
3. (unstack b2 b135)
   deleted: (on b2 b135) (clear b2) (arm-empty)
   added: (holding b2) (clear b135)
   goals met: 2 of 8
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 8
5. (unstack b71 b75)
   deleted: (on b71 b75) (clear b71) (arm-empty)
   added: (holding b71) (clear b75)
   goals met: 4 of 8
6. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 4 of 8
7. (unstack b75 b52)
   deleted: (on b75 b52) (clear b75) (arm-empty)
   added: (holding b75) (clear b52)
   goals met: 4 of 8
8. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 4 of 8
9. (unstack b52 b103)
   deleted: (on b52 b103) (clear b52) (arm-empty)
   added: (holding b52) (clear b103)
   goals met: 4 of 8
10. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 8
11. (unstack b103 b55)
   deleted: (on b103 b55) (clear b103) (arm-empty)
   added: (holding b103) (clear b55)
   goals met: 4 of 8
12. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 4 of 8
13. (unstack b55 b60)
   deleted: (on b55 b60) (clear b55) (arm-empty)
   added: (holding b55) (clear b60)
   goals met: 4 of 8
14. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 4 of 8
15. (unstack b60 b47)
   deleted: (on b60 b47) (clear b60) (arm-empty)
   added: (holding b60) (clear b47)
   goals met: 4 of 8
16. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 4 of 8
17. (unstack b47 b48)
   deleted: (on b47 b48) (clear b47) (arm-empty)
   added: (holding b47) (clear b48)
   goals met: 4 of 8
18. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 4 of 8
19. (unstack b48 b4)
   deleted: (on b48 b4) (clear b48) (arm-empty)
   added: (holding b48) (clear b4)
   goals met: 5 of 8
20. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 5 of 8
21. (unstack b4 b40)
   deleted: (on b4 b40) (clear b4) (arm-empty)
   added: (holding b4) (clear b40)
   goals met: 4 of 8
22. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 8
23. (unstack b85 b84)
   deleted: (on b85 b84) (clear b85) (arm-empty)
   added: (holding b85) (clear b84)
   goals met: 6 of 8
24. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 6 of 8
25. (unstack b84 b138)
   deleted: (on b84 b138) (clear b84) (arm-empty)
   added: (holding b84) (clear b138)
   goals met: 6 of 8
26. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 6 of 8
27. (unstack b138 b102)
   deleted: (on b138 b102) (clear b138) (arm-empty)
   added: (holding b138) (clear b102)
   goals met: 6 of 8
28. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 6 of 8
29. (unstack b102 b3)
   deleted: (on b102 b3) (clear b102) (arm-empty)
   added: (holding b102) (clear b3)
   goals met: 7 of 8
30. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 7 of 8
31. (unstack b3 b130)
   deleted: (on b3 b130) (clear b3) (arm-empty)
   added: (holding b3) (clear b130)
   goals met: 6 of 8
32. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 8 of 8
